---
kind: property
id: P:Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs.Location
source: html/c13b3202-8d75-08c1-1f3b-0ee1f81721c9.htm
---
# Autodesk.Revit.DB.Events.DocumentSynchronizingWithCentralEventArgs.Location Property

Full path of the central model which is to be synchronized.

## Syntax (C#)
```csharp
public string Location { get; }
```